backend/artillery/reportloadtest.yml
config:
  target: 'http://localhost:8000'
  phases:
    # - duration: 10
    #   arrivalRate: 5
    #   name: Test
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 35
      name: Ramp up load
    - duration: 600
      arrivalRate: 35
      name: Sustained load
  payload:
    - path: "reportOptions.csv"
      fields:
      - "ascending"
      - "reportFormat"
scenarios:
- name: "Generate company values report"
  flow:
    - post:
        url: "/user/signin"
        json: 
          username: "admin"
          password: "Password1!"
        jar: true
    - get:
        url: "/report/company-values?reportformat={{ reportFormat }}&ascending={{ ascending }}"
# - name: "Generate held shares report"
#   flow:
#     - post:
#         url: "/user/signin"
#         json: 
#           username: "admin"
#           password: "Password1!"
#         jar: true
#     - get:
#         url: "/report/held-shares"
#         json: 
#           reportformat: "{{ reportFormat }}"
#           ascending: "{{ ascending }}"
# - name: "Generate company details report"
#   flow:
#     - post:
#         url: "/user/signin"
#         json: 
#           username: "admin"
#           password: "Password1!"
#         jar: true
#     - get:
#         url: "/stock/getOne"
#         json: 
#           symbol: "C"
#         capture:
#           json: "$.id"
#           as: "stockid"
#     - get:
#         url: "/report/company-details"
#         json: 
#           stockids: "[{{ stockid }}]"
#           reportformat: "{{ reportFormat }}"
#           ascending: "{{ ascending }}"
# - name: "Generate and download report"
#   flow:
#     - post:
#         url: "/user/signin"
#         json: 
#           username: "admin"
#           password: "Password1!"
#         jar: true
#     - get:
#         url: "/report/company-values"
#         json: 
#           reportformat: "{{ reportFormat }}"
#           ascending: "{{ ascending }}"
#         capture:
#           json: "$.id"
#           as: "reportid"
#     - get:
#         url: "/download"
#         json: 
#           report_id: "{{ reportid }}"