backend/artillery/reportloadtest.yml
config:
  target: "http://localhost:8000"
  phases:
    # - duration: 10
    #   arrivalRate: 5
    #   name: Test
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 35
      name: Ramp up load
    - duration: 600
      arrivalRate: 35
      name: Sustained load
  payload:
    - path: "reportOptions.csv"
      fields:
        - "ascending"
        - "reportFormat"
before:
  flow:
    - log: "Get user auth tokens"
    - post:
        url: "/user/signin"
        json:
          username: "user"
          password: "Password1!"
        capture:
          header: "set-cookie"
          as: "user_token"
    - post:
        url: "/user/validate"
        capture:
          json: "$"
          as: "user_data"
        headers:
          Cookie: "{{ user_token }}"
    - get:
        url: "/report/company-values?reportformat={{ reportFormat }}&ascending={{ ascending }}"
        capture:
          json: "$.reports[0]._id"
          as: "report_id"
        headers:
          Cookie: "{{ user_token }}"
    - post:
        url: "/user/signin"
        json:
          username: "admin"
          password: "Password1!"
        capture:
          header: "set-cookie"
          as: "admin_token"
    - post:
        url: "/user/validate"
        capture:
          json: "$"
          as: "admin_data"
        headers:
          Cookie: "{{ admin_token }}"
    - post:
        url: "/user/signin"
        json:
          username: "broker"
          password: "Password1!"
        capture:
          header: "set-cookie"
          as: "broker_token"
    - post:
        url: "/user/validate"
        capture:
          json: "$"
          as: "broker_data"
        headers:
          Cookie: "{{ broker_token }}"
    - log: "report: {{ report_id }}"
    - log: "user token: {{ user_token }}"
    - log: "admin token: {{ admin_token }}"
    - log: "broker token: {{ broker_token }}"
scenarios:
  - name: "Generate company values report"
    flow:
      - get:
          url: "/report/company-values?reportformat={{ reportFormat }}&ascending={{ ascending }}"
          headers:
            Cookie: "{{ user_token }}"
  - name: "Generate held shares report"
    flow:
      - get:
          url: "/report/held-shares?reportformat={{ reportFormat }}&ascending={{ ascending }}"
          headers:
            Cookie: "{{ user_token }}"
  - name: "Generate company details report"
    flow:
      - get:
          url: "/stock/getOne?symbol=C"
          # json:
          #   symbol: "C"
          capture:
            json: "$.id"
            as: "stockid"
          headers:
            Cookie: "{{ admin_token }}"
      - get:
          url: "/report/company-details?stockids[]={{ stockid }}&reportformat={{ reportFormat }}&ascending={{ ascending }}"
          headers:
            Cookie: "{{ user_token }}"
  - name: "Generate and download report"
    flow:
      - get:
          url: "/report/download?report_id={{ report_id }}&user_id={{ user_data.id }}"
          headers:
            Cookie: "{{ user_token }}"